# Определите базовый образ, здесь используется официальный образ Node.js
FROM node:12-alpine

# Установите рабочую директорию внутри контейнера
WORKDIR .

# Копируйте файлы, связанные с зависимостями, и установите зависимости
COPY package.json yarn.lock ./
RUN yarn install --frozen-lockfile

# Копируйте остальные файлы проекта в контейнер
COPY . .

# Соберите ваше React приложение
RUN yarn build

# Установите веб-сервер для статических файлов
RUN yarn global add serve

# Откройте порт, который будет использоваться веб-сервером
EXPOSE 3000

# Запустите веб-сервер
CMD ["serve", "-s", "build", "-l", "3000"]
